mhaberler/canopennode/CANopen_stack/stm32f4xx/CO_driver.c
/*
 * CAN module object for Microchip STM32F4xx microcontroller.
 *
 * @file        CO_driver.c
 * @version     SVN: \$Id: CO_driver.h 278 2013-03-04 17:11:47Z jani $
 * @author      Janez Paternoster
 * @author      Ondrej Netik
 * @copyright   2004 - 2013 Janez Paternoster, Ondrej Netik
 *
 * This file is part of CANopenNode, an opensource CANopen Stack.
 * Project home page is <http://canopennode.sourceforge.net>.
 * For more information on CANopen see <http://www.can-cia.org/>.
 *
 * CANopenNode is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */


#include <string.h>     // for memcpy
#include <stdlib.h>     // for malloc, free
#include <stddef.h>		// for NULL

// Custom
#include "config.h"
#include "trace.h"

#include <stm32f4xx_conf.h>
#include "CO_driver.h"
#include "CO_Emergency.h"



void InitCanLeds() {
    GPIO_InitTypeDef GPIO_InitStructure;
    RCC_AHB1PeriphClockCmd(LED_GPIO_CLOCK, ENABLE);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_Led_GREEN | GPIO_Pin_Led_RED;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIO_LEDS, &GPIO_InitStructure);
    CanLedsOff(eCoLed_Green | eCoLed_Red);
}

void CanLedsSet(eCoLeds led) {
    if (led & eCoLed_Green)
        CanLedsOn(eCoLed_Green);
    else
        CanLedsOff(eCoLed_Green);

    if (led & eCoLed_Red)
        CanLedsOn(eCoLed_Red);
    else
        CanLedsOff(eCoLed_Red);
}

void CanLedsOn(eCoLeds led) {
    if (led & eCoLed_Green) {
#ifdef LED_POSITIVE
        GPIO_SetBits(GPIO_LEDS, GPIO_Pin_Led_GREEN);
#else
        GPIO_ResetBits(GPIO_LEDS, GPIO_Pin_Led_GREEN);
#endif
    }
    if (led & eCoLed_Red) {
#ifdef LED_POSITIVE
        GPIO_SetBits(GPIO_LEDS, GPIO_Pin_Led_RED);
#else
        GPIO_ResetBits(GPIO_LEDS, GPIO_Pin_Led_RED);
#endif
    }
}

void CanLedsOff(eCoLeds led) {
    if (led & eCoLed_Green) {
#ifdef LED_POSITIVE
        GPIO_ResetBits(GPIO_LEDS, GPIO_Pin_Led_GREEN);
#else
        GPIO_SetBits(GPIO_LEDS, GPIO_Pin_Led_GREEN);
#endif
    }
    if (led & eCoLed_Red) {
#ifdef LED_POSITIVE
        GPIO_ResetBits(GPIO_LEDS, GPIO_Pin_Led_RED);
#else
        GPIO_SetBits(GPIO_LEDS, GPIO_Pin_Led_RED);
#endif
    }
}

/******************************************************************************/
#ifdef BIG_ENDIAN
void memcpySwap2(uint8_t* dest, uint8_t* src){
    *(dest++) = *(src+1);
    *(dest) = *(src);
}

void memcpySwap4(uint8_t* dest, uint8_t* src){
    src += 3;
    *(dest++) = *(src--);
    *(dest++) = *(src--);
    *(dest++) = *(src--);
    *(dest) = *(src);
}
#else
void memcpySwap2(uint8_t* dest, uint8_t* src){
    *(dest++) = *(src++);
    *(dest) = *(src);
}

void memcpySwap4(uint8_t* dest, uint8_t* src){
    *(dest++) = *(src++);
    *(dest++) = *(src++);
    *(dest++) = *(src++);
    *(dest) = *(src);
}
#endif


/*******************************************************************************
   Macro and Constants - CAN module registers
 *******************************************************************************/
void CO_CANsetConfigurationMode(CAN_TypeDef *CANbaseAddress) {
//    unsigned int wait_ack = 0;

    /* Request initialisation */
//    CANbaseAddress->MCR |= CAN_MCR_INRQ;

    /* Wait the acknowledge */
//    while (((CANbaseAddress->MSR & CAN_MSR_INAK) != CAN_MSR_INAK) && (wait_ack != INAK_TIMEOUT))
//        wait_ack++;

    /* Check acknowledge */
//    if ((CANbaseAddress->MSR & CAN_MSR_INAK) != CAN_MSR_INAK) {
        // enter to configuration mode failed

//    }


}

/******************************************************************************/
void CO_CANsetNormalMode(CAN_TypeDef *CANbaseAddress) {
//    unsigned int wait_ack = 0;

    /* Request leave initialisation */
//    CANbaseAddress->MCR &= ~(uint32_t) CAN_MCR_INRQ;

    /* Wait the acknowledge */
//    while (((CANbaseAddress->MSR & CAN_MSR_INAK) == CAN_MSR_INAK) && (wait_ack != INAK_TIMEOUT))
//        wait_ack++;

    /* ...and check acknowledged */
//    if ((CANbaseAddress->MSR & CAN_MSR_INAK) == CAN_MSR_INAK) {
        // leave initialization state failed

//    }

}

static void CO_CanInterruptEnDis(CAN_TypeDef *CANbaseAddress, uint8_t enb) {
    CAN_ITConfig(CANbaseAddress,
    		//CAN_IT_TME | // Tx
            CAN_IT_FMP0  // Rx
            //CAN_IT_ERR |  // Error Interrupt
            //CAN_IT_BOF |  // BusOff interrupt
            //CAN_IT_EPV |  // Error Passive
            //CAN_IT_EWG    // Error Warning
            , enb);
}

/******************************************************************************/
int16_t CO_CANmodule_init(
        CO_CANmodule_t **ppCANmodule,
        CAN_TypeDef *CANbaseAddress,
        uint16_t rxSize,
        uint16_t txSize,
        uint16_t CANbitRate) {
    CAN_InitTypeDef CAN_InitStruct;
    CAN_FilterInitTypeDef CAN_FilterInitStruct;
    GPIO_InitTypeDef GPIO_InitStructure;
    int i;
    if ((*ppCANmodule) == NULL) {
        if (((*ppCANmodule) = (CO_CANmodule_t *) malloc(sizeof (CO_CANmodule_t))) == NULL) {
            return CO_ERROR_OUT_OF_MEMORY;
        }
        if (((*ppCANmodule)->rxArray = (CO_CANrx_t *) malloc(rxSize * sizeof (CO_CANrx_t))) == NULL) {
            free(*ppCANmodule);
            *ppCANmodule = 0;
            return CO_ERROR_OUT_OF_MEMORY;
        }
        if (((*ppCANmodule)->txArray = (CO_CANtx_t *) malloc(txSize * sizeof (CO_CANtx_t))) == NULL) {
            free((*ppCANmodule)->rxArray);
            free(*ppCANmodule);
            *ppCANmodule = 0;
            return CO_ERROR_OUT_OF_MEMORY;
        }
    } else if ((*ppCANmodule)->rxArray == NULL || (*ppCANmodule)->txArray == NULL) return CO_ERROR_ILLEGAL_ARGUMENT;

    CO_CANmodule_t *CANmodule = *ppCANmodule; //pointer to (newly created) object

