mhaberler/canopennode/CANopen_stack/stm32f4xx/CO_driver.c
    CANmodule->CANbaseAddress = CANbaseAddress;
    CANmodule->rxSize = rxSize;
    CANmodule->txSize = txSize;
    CANmodule->curentSyncTimeIsInsideWindow = 0;
    CANmodule->bufferInhibitFlag = 0;
    CANmodule->transmittingAborted = 0;
    CANmodule->firstCANtxMessage = 1;
    CANmodule->CANtxCount = 0;
    CANmodule->errOld = 0;
    CANmodule->EM = 0;

    CO_CanInterruptEnDis(CANbaseAddress, DISABLE);

    for (i = 0; i < rxSize; i++) {
        CANmodule->rxArray[i].ident = 0;
        CANmodule->rxArray[i].pFunct = 0;
    }
    for (i = 0; i < txSize; i++) {
        CANmodule->txArray[i].bufferFull = 0;
    }

    /* Setting Clock of CAN HW */
    RCC_APB1PeriphClockCmd( CLOCK_CAN, ENABLE);
    RCC_AHB1PeriphClockCmd( CAN_GPIO_CLK, ENABLE);
	GPIO_PinAFConfig(GPIO_CAN, GPIO_PinSource1, GPIO_AF_CAN1);
	GPIO_PinAFConfig(GPIO_CAN, GPIO_PinSource0, GPIO_AF_CAN1);

	/* Configure CAN pin: RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN_RX;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_Init(GPIO_CAN, &GPIO_InitStructure);

	/* Configure CAN pin: TX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN_TX;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIO_CAN, &GPIO_InitStructure);

    //GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);



    /* Init CAN controler */
    CAN_DeInit(CANmodule->CANbaseAddress);

#if 1
    /* Hard-coded for 125k baudrate */
    CAN_InitStruct.CAN_Prescaler = 16; // 125k baudrate
    CAN_InitStruct.CAN_BS1 = CAN_BS1_14tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_6tq;
#else
    /* This code is not written for default STM32F4xx bus speed */
    CAN_StructInit(&CAN_InitStruct);
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_2tq;
    switch (CANbitRate) {
        case 1000: CAN_InitStruct.CAN_Prescaler = 6;
            break;
        case 500: CAN_InitStruct.CAN_Prescaler = 12;
            break;
        default:
        case 250: CAN_InitStruct.CAN_Prescaler = 24;
            break;
        case 125: CAN_InitStruct.CAN_Prescaler = 48;
            break;
        case 100: CAN_InitStruct.CAN_Prescaler = 60;
            break;
        case 50: CAN_InitStruct.CAN_Prescaler = 120;
            break;
        case 20: CAN_InitStruct.CAN_Prescaler = 300;
            break;
        case 10: CAN_InitStruct.CAN_Prescaler = 600;
            break;
    }
#endif

    CAN_InitStruct.CAN_Mode = CAN_Mode_Normal;
    //CAN_InitStruct.CAN_Mode=CAN_Mode_Silent_LoopBack;
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_TTCM = DISABLE;  // Time Trigger
    CAN_InitStruct.CAN_ABOM = DISABLE;	// Automatic bus off management
    CAN_InitStruct.CAN_AWUM = DISABLE;	// Automatic Wakeup mode
    CAN_InitStruct.CAN_NART = DISABLE;	// No Automatic retransmision
    CAN_InitStruct.CAN_RFLM = DISABLE;	// Receive FIFO locked mode
    CAN_InitStruct.CAN_TXFP = DISABLE;	// Transmit FIFO priority 1=chronologically 0=by identifier

    TRACE_DEBUG("CAN_Init ");
    uint8_t result;
    if ((result = CAN_Init(CANmodule->CANbaseAddress, &CAN_InitStruct)) != CAN_InitStatus_Success) {
        TRACE_DEBUG_WP("res=%d\n\r", result);
        return result;
    }
    // nastavime 1 filtr, ktery prijima vse
    memset(&CAN_FilterInitStruct, 0, sizeof (CAN_FilterInitStruct));
    CAN_FilterInitStruct.CAN_FilterNumber = 0;
    CAN_FilterInitStruct.CAN_FilterIdHigh = 0;
    CAN_FilterInitStruct.CAN_FilterIdLow = 0;
    CAN_FilterInitStruct.CAN_FilterMaskIdHigh = 0;
    CAN_FilterInitStruct.CAN_FilterMaskIdLow = 0;
    CAN_FilterInitStruct.CAN_FilterFIFOAssignment = 0; // pouzivame jen FIFO0
    CAN_FilterInitStruct.CAN_FilterMode = CAN_FilterMode_IdMask;
    CAN_FilterInitStruct.CAN_FilterScale = CAN_FilterScale_32bit;
    CAN_FilterInitStruct.CAN_FilterActivation = ENABLE;
    CAN_FilterInit(&CAN_FilterInitStruct);

    // povoleni preruseni od CAN1
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    // Enable CAN1 RX interrupt
    NVIC_InitStructure.NVIC_IRQChannel = CAN1_RX0_IRQn; // | CAN1_TX_IRQn;
    NVIC_Init(&NVIC_InitStructure);

    // Enable CAN1 TX interrupt
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannel = CAN1_TX_IRQn;
    NVIC_Init(&NVIC_InitStructure);



    CAN_OperatingModeRequest(CANmodule->CANbaseAddress, CAN_OperatingMode_Normal);

    CO_CanInterruptEnDis(CANbaseAddress, ENABLE);
    TRACE_DEBUG_WP("Ok\n\r");

    return CO_ERROR_NO;
}

/******************************************************************************/
void CO_CANmodule_delete(CO_CANmodule_t** ppCANmodule) {
    if (*ppCANmodule) {
        CAN_DeInit((*ppCANmodule)->CANbaseAddress);
        free((*ppCANmodule)->txArray);
        free((*ppCANmodule)->rxArray);
        free(*ppCANmodule);
        *ppCANmodule = 0;
    }
}

/******************************************************************************/
uint16_t CO_CANrxMsg_readIdent(CO_CANrxMsg_t *rxMsg) {
    return (rxMsg->ident >> 2) & 0x7FF;
}

/******************************************************************************/
int16_t CO_CANrxBufferInit(CO_CANmodule_t *CANmodule,
        uint16_t index,
        uint16_t ident,
        uint16_t mask,
        uint8_t rtr,
        void *object,
        int16_t(*pFunct)(void *object, CO_CANrxMsg_t *message)) {
    CO_CANrx_t *rxBuffer;
    uint16_t RXF, RXM;

    //safety
    if (!CANmodule || !object || !pFunct || index >= CANmodule->rxSize) {
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }

    //buffer, which will be configured
    rxBuffer = CANmodule->rxArray + index;

