mhaberler/canopennode/CANopen_stack/stm32f4xx/CO_driver.c
    //Configure object variables
    rxBuffer->object = object;
    rxBuffer->pFunct = pFunct;


    //CAN identifier and CAN mask, bit aligned with CAN module registers
    RXF = (ident & 0x07FF) << 2;
    if (rtr) RXF |= 0x02;
    RXM = (mask & 0x07FF) << 2;
    RXM |= 0x02;

    //configure filter and mask
    if (RXF != rxBuffer->ident || RXM != rxBuffer->mask) {
        rxBuffer->ident = RXF;
        rxBuffer->mask = RXM;
    }

    return CO_ERROR_NO;
}

/******************************************************************************/
CO_CANtx_t *CO_CANtxBufferInit(
        CO_CANmodule_t *CANmodule,
        uint16_t index,
        uint16_t ident,
        uint8_t rtr,
        uint8_t noOfBytes,
        uint8_t syncFlag) {
    //safety
    if (!CANmodule || CANmodule->txSize <= index) return 0;

    //get specific buffer
    CO_CANtx_t *buffer = &CANmodule->txArray[index];

    //CAN identifier, bit aligned with CAN module registers

    uint32_t TXF = 0;
    TXF = ident << (uint32_t)21;
    TXF &= 0xFFE00000;
    if (rtr) TXF |= 0x02;

    buffer->ident = TXF;

    //write to buffer
    buffer->DLC = noOfBytes;
    buffer->bufferFull = 0;
    buffer->syncFlag = syncFlag ? 1 : 0;

    return buffer;
}

int8_t getFreeTxBuff(CO_CANmodule_t *CANmodule) {
	uint8_t txBuff = 0;
	for (txBuff = 0; txBuff <= 3; txBuff++)
		//if (CAN_TransmitStatus(CANmodule->CANbaseAddress, txBuff) == CAN_TxStatus_Ok)
		switch (txBuff) {
		case (CAN_TXMAILBOX_0 ):
			if (CANmodule->CANbaseAddress->TSR & CAN_TSR_TME0 )
				return txBuff;
			else
				break;
		case (CAN_TXMAILBOX_1 ):
			if (CANmodule->CANbaseAddress->TSR & CAN_TSR_TME1 )
				return txBuff;
			else
				break;
		case (CAN_TXMAILBOX_2 ):
			if (CANmodule->CANbaseAddress->TSR & CAN_TSR_TME2 )
				return txBuff;
			else
				break;
		}
	return -1;
}

/******************************************************************************/
int16_t CO_CANsend(CO_CANmodule_t *CANmodule, CO_CANtx_t *buffer) {
   //Code related to CO_CANclearPendingSyncPDOs() function:
   if(CANmodule->transmittingAborted){
    //if message was aborted on buffer, set interrupt flag
    //TODO:  if(CAN_REG(addr, C_TXBUF0 + C_TXCON) & 0x40){CANmodule->transmittingAborted--; CAN_REG(addr, C_INTF) |= 0x04;}
   }

   //Was previous message sent or it is still waiting?
   if(buffer->bufferFull){
      if(!CANmodule->firstCANtxMessage)//don't set error, if bootup message is still on buffers
         CO_errorReport((CO_EM_t*)CANmodule->EM, ERROR_CAN_TX_OVERFLOW, 0);
      return CO_ERROR_TX_OVERFLOW;
   }

   //messages with syncFlag set (synchronous PDOs) must be transmited inside preset time window
   if(CANmodule->curentSyncTimeIsInsideWindow && buffer->syncFlag && !(*CANmodule->curentSyncTimeIsInsideWindow)){
      CO_errorReport((CO_EM_t*)CANmodule->EM, ERROR_TPDO_OUTSIDE_WINDOW, 0);
      return CO_ERROR_TX_PDO_WINDOW;
   }

   //if CAN TB buffer0 is free, copy message to it
   int8_t txBuff = getFreeTxBuff(CANmodule);
   if( (txBuff!=-1)  && CANmodule->CANtxCount == 0){
      CANmodule->bufferInhibitFlag = buffer->syncFlag;
      CO_CANsendToModule(CANmodule, buffer, txBuff);
   }
   //if no buffer is free, message will be sent by interrupt
   else{
      buffer->bufferFull = 1;
      CANmodule->CANtxCount++;
      // vsechny buffery jsou plny, musime povolit preruseni od vysilace, odvysilat az v preruseni
      CAN_ITConfig(CANmodule->CANbaseAddress, CAN_IT_TME, ENABLE);
   }

   return CO_ERROR_NO;
}
/******************************************************************************/
void CO_CANclearPendingSyncPDOs(CO_CANmodule_t *CANmodule) {
    DISABLE_INTERRUPTS();

    if (CANmodule->bufferInhibitFlag) {
        CANmodule->CANbaseAddress->TSR |= CAN_TSR_ABRQ0 | CAN_TSR_ABRQ1 | CAN_TSR_ABRQ2;
        ENABLE_INTERRUPTS();
        CO_errorReport((CO_EM_t*) CANmodule->EM, ERROR_TPDO_OUTSIDE_WINDOW, 0);
    } else
        ENABLE_INTERRUPTS();
}

/******************************************************************************/
void CO_CANverifyErrors(CO_CANmodule_t *CANmodule) {
   uint32_t err;
   CO_EM_t* EM = (CO_EM_t*)CANmodule->EM;

   err = CANmodule->CANbaseAddress->ESR;
   // if(CAN_REG(CANmodule->CANbaseAddress, C_INTF) & 4) err |= 0x80;

   if(CANmodule->errOld != err){
      CANmodule->errOld = err;

      //CAN RX bus overflow
      if(CANmodule->CANbaseAddress->RF0R & 0x08){
         CO_errorReport(EM, ERROR_CAN_RXB_OVERFLOW, err);
         CANmodule->CANbaseAddress->RF0R &=~0x08;//clear bits
      }

      //CAN TX bus off
      if(err & 0x04) CO_errorReport(EM, ERROR_CAN_TX_BUS_OFF, err);
      else           CO_errorReset(EM, ERROR_CAN_TX_BUS_OFF, err);

      //CAN TX or RX bus passive
      if(err & 0x02){
         if(!CANmodule->firstCANtxMessage) CO_errorReport(EM, ERROR_CAN_TX_BUS_PASSIVE, err);
      }
      else{
         int16_t wasCleared;
         wasCleared =        CO_errorReset(EM, ERROR_CAN_TX_BUS_PASSIVE, err);
         if(wasCleared == 1) CO_errorReset(EM, ERROR_CAN_TX_OVERFLOW, err);
      }


      //CAN TX or RX bus warning
      if(err & 0x01){
         CO_errorReport(EM, ERROR_CAN_BUS_WARNING, err);
      }
      else{
         CO_errorReset(EM, ERROR_CAN_BUS_WARNING, err);
      }
   }
}

/******************************************************************************/
int CO_CANrecFromModule(CO_CANmodule_t *CANmodule, uint8_t FIFONumber, CO_CANrxMsg_t* RxMessage) {
    if( (CANmodule->CANbaseAddress->RF0R & CAN_RF0R_FMP0) > 0) {  // We really have something
        RxMessage->IDE = (uint8_t) 0x04 & CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RIR;
        if (RxMessage->IDE == CAN_Id_Standard) {
            RxMessage->ident = (uint32_t) 0x000007FF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RIR >> 21);
        } else {
            RxMessage->ExtId = (uint32_t) 0x1FFFFFFF & (CANmodule->CANbaseAddress->sFIFOMailBox[FIFONumber].RIR >> 3);
        }

